{
  "backend/main.mo": "Motoko backend storing collections, products, and contact messages with CRUD-style methods and query endpoints.",
  "feature_evidence.json": "Feature evidence report describing added static aesthetic clothing images and related components and tests.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to descriptive summaries of their roles in the app.",
  "frontend/index.css": "Tailwind base stylesheet defining color tokens, dark mode variables, and global styles.",
  "frontend/index.html": "Root HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, shop, product detail, about, and contact, wrapped in SiteLayout.",
  "frontend/src/components/catalog/CollectionCard.tsx": "UI card for displaying a collection with image, description, and button.",
  "frontend/src/components/catalog/ProductCard.tsx": "UI card linking to product detail showing image, availability badge, price, and tags.",
  "frontend/src/components/contact/ContactForm.tsx": "Controlled contact form with validation, error display, and submission via mutation hook.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with brand mark, navigation links, contact info, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with brand logo, navigation links, and mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper rendering header, main content, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCatalogQueries.ts": "Provides React Query hooks to fetch collections and products through the actor, including filtered and single-item queries.",
  "frontend/src/hooks/useContactMutation.ts": "Defines mutations for submitting contact messages and retrieving stored messages using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling auth client setup, identity loading, login, and logout.",
  "frontend/src/index.css": "Sets global Tailwind styles, theme variables, dark mode variants, typography, and background textures.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying company philosophy, craftsmanship, sustainability, and vision sections.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with submission feedback and displays company contact info, hours, and FAQs.",
  "frontend/src/pages/HomePage.tsx": "Home page showing a hero section, featured collections, new products, and various promotional sections fetched via catalog hooks.",
  "frontend/src/pages/ProductPage.tsx": "Displays a detailed product page with loading and error states, showing images, pricing, availability, tags, description, and variant options.",
  "frontend/src/pages/ShopPage.tsx": "Renders the main shop view with product and collection data, filters by collection, and handles loading and error states.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Defines the project’s state, features, required imagery, and architectural notes for building the clothing brand website."
}